import { AuthorAbout } from "@/app/components/AuthorAbout";
import Image from "next/image";

type postformat = {
  _id: string;
  title: string;
  postImageUrl: string;
  content: string;
  author: string;
  category: string;
};

type posttype = {
  post: postformat;
};

export const PostOnlyComponent = ({ post }: posttype) => {
  return (
    <div className="flex flex-col gap-5 py-10">
      <div className="text-2xl font-medium">
        Б.Баярбаатар: УИХ-ын гишүүнийх нь хувьд гомдол ирвэл Л.Оюун-Эрдэнийн
        асуудлаар дүгнэлт гаргахад бэлэн
      </div>
      <div>
        <div>
          <div className="text-red-500">М.Батчимэг Ikon.mn</div>
          <div>3 цаг 52 минутын өмнө</div>
        </div>
        <div></div>
      </div>
      <div className="border border-orange-500 "></div>
      <div className="relative w-full h-130">
        <Image
          src="/chatgpt.jpg"
          alt="post image"
          fill
          className="object-cover"
        />
      </div>
      <div className="text-justify">
        Монгол, Хятадын Гашуусухайт-Ганцмод төмөр замын боомтын хил холболтын
        бүтээн байгуулалтын нээлт энэ сарын 13-нд хоёр улсын хилийн зааг дээр
        боллоо. Энэ үеэр “Монголын төмөр зам” ТӨХК, “Чайна Энержи Коксжих нүүрс
        (Тяньжин)” ХХК хоорондын Нүүрс тээвэрлэлтийн урт хугацааны гэрээнд гарын
        үсэг зурав. Гэрээнд “Монголын төмөр зам” ТӨХК-ийн Гүйцэтгэх захирал
        О.Батчулуун, “Чайна Энержи Коксжих нүүрс (Тяньжин)” ХХК-ийн Ерөнхий
        захирал Ян Зэкүнь нар гарын үсэг зурав. О.Батчулуун захирал
        "Тавантолгойн уурхайгаас Ганц мод боомт хүртэл хүргэх нүүрсний тээврийг
        хийх түүхэн гэрээг байгууллаа. 16 жилийн турш энэ тээврийг тогтвортой
        хийснээр манай компани өнөөгийн үнэ цэнээр 2.5 тэрбум долларын ашиг олох
        боломжтой. Энэ бол түүхэн гэрээ. Анх удаа Монголын үндэсний компани ийм
        гэрээ байгуулав. Богинын тээврийг авто замаар хийнэ. Төмөр замын
        шилжүүлэн ачих терминалаас нүүрсээ Ганцмод боомт хүртэл тээвэрлэх замыг
        богинын тээвэр гэдэг. Үүнийг оролцуулбал 3.7 тэрбум ам.долларын орлого
        олох боломжтой. Тээврийн үнийг жил бүр индексжүүлнэ. Нүүрсний үнэ өсвөл
        тээврийн үнэ дагаад өснө" гэв.
      </div>
      <AuthorAbout />
    </div>
  );
};
